Madoka-Daigo/NRF52832/main.c
//                index = 0;
//            }
//            break;

//        case APP_UART_COMMUNICATION_ERROR:
//            APP_ERROR_HANDLER(p_event->data.error_communication);
//            break;

//        case APP_UART_FIFO_ERROR:
//            APP_ERROR_HANDLER(p_event->data.error_code);
//            break;

//        default:
//            break;
//    }
}
/**@snippet [Handling the data received over UART] */


/**@brief  Function for initializing the UART module.
 */
/**@snippet [UART Initialization] */
static void uart_init(void)
{
    uint32_t                     err_code;
    app_uart_comm_params_t const comm_params =
    {
        .rx_pin_no    = RX_PIN_NUMBER,
        .tx_pin_no    = TX_PIN_NUMBER,
        .rts_pin_no   = RTS_PIN_NUMBER,
        .cts_pin_no   = CTS_PIN_NUMBER,
        .flow_control = APP_UART_FLOW_CONTROL_DISABLED,
        .use_parity   = false,
#if defined (UART_PRESENT)
        .baud_rate    = NRF_UART_BAUDRATE_115200
#else
        .baud_rate    = NRF_UARTE_BAUDRATE_115200
#endif
    };

    APP_UART_FIFO_INIT(&comm_params,
                       UART_RX_BUF_SIZE,
                       UART_TX_BUF_SIZE,
                       uart_event_handle,
                       APP_IRQ_PRIORITY_LOWEST,
                       err_code);
    APP_ERROR_CHECK(err_code);
}
/**@snippet [UART Initialization] */


/**@brief Function for initializing the Advertising functionality.
 */
static void advertising_init(void)
{
    uint32_t               err_code;
    ble_advertising_init_t init;

    memset(&init, 0, sizeof(init));

    init.advdata.name_type          = BLE_ADVDATA_FULL_NAME;
    init.advdata.include_appearance = false;
    init.advdata.flags              = BLE_GAP_ADV_FLAGS_LE_ONLY_GENERAL_DISC_MODE;

    init.srdata.uuids_complete.uuid_cnt = sizeof(m_adv_uuids) / sizeof(m_adv_uuids[0]);
    init.srdata.uuids_complete.p_uuids  = m_adv_uuids;

    init.config.ble_adv_fast_enabled  = true;
    init.config.ble_adv_fast_interval = APP_ADV_INTERVAL;
    init.config.ble_adv_fast_timeout  = APP_ADV_DURATION;
    init.evt_handler = on_adv_evt;

    err_code = ble_advertising_init(&m_advertising, &init);
    APP_ERROR_CHECK(err_code);

    ble_advertising_conn_cfg_tag_set(&m_advertising, APP_BLE_CONN_CFG_TAG);
    
    err_code = sd_ble_gap_tx_power_set(BLE_GAP_TX_POWER_ROLE_ADV,m_advertising.adv_handle,4);
    APP_ERROR_CHECK(err_code);    
}


/**@brief Function for initializing buttons and leds.
 *
 * @param[out] p_erase_bonds  Will be true if the clear bonding button was pressed to wake the application up.
 */
static void buttons_leds_init(bool * p_erase_bonds)
{
    bsp_event_t startup_event;

    uint32_t err_code = bsp_init(BSP_INIT_LEDS | BSP_INIT_BUTTONS, bsp_event_handler);
    APP_ERROR_CHECK(err_code);

    err_code = bsp_btn_ble_init(NULL, &startup_event);
    APP_ERROR_CHECK(err_code);

    *p_erase_bonds = (startup_event == BSP_EVENT_CLEAR_BONDING_DATA);
}


/**@brief Function for initializing the nrf log module.
 */
//static void log_init(void)
//{
//    ret_code_t err_code = NRF_LOG_INIT(NULL);
//    APP_ERROR_CHECK(err_code);

//    NRF_LOG_DEFAULT_BACKENDS_INIT();
//}


/**@brief Function for initializing power management.
 */
//static void power_management_init(void)
//{
//    ret_code_t err_code;
//    err_code = nrf_pwr_mgmt_init();
//    APP_ERROR_CHECK(err_code);
//}


/**@brief Function for handling the idle state (main loop).
 *
 * @details If there is no pending log operation, then sleep until next the next event occurs.
 */
static void idle_state_handle(void)
{
    if (NRF_LOG_PROCESS() == false)
    {
        nrf_pwr_mgmt_run();
    }
}


/**@brief Function for starting advertising.
 */
static void advertising_start(void)
{
    uint32_t err_code = ble_advertising_start(&m_advertising, BLE_ADV_MODE_FAST);
    APP_ERROR_CHECK(err_code);
}
//SAADC事件回调函数，因为是堵塞模式，所以不需要事件，这里定义了一个空的事件回调函数
void saadc_callback(nrf_drv_saadc_evt_t const * p_event){}


//初始化SAADC，配置使用的SAADC通道的参数
void saadc_init(void)
{
    ret_code_t err_code;
	  //定义ADC通道配置结构体，并使用单端采样配置宏初始化，
	  //NRF_SAADC_INPUT_AIN2是使用的模拟输入通道

    nrf_saadc_channel_config_t channel_config0 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN0);
    nrf_saadc_channel_config_t channel_config1 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN1);
    nrf_saadc_channel_config_t channel_config2 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN2);  
    nrf_saadc_channel_config_t channel_config3 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN3);
    nrf_saadc_channel_config_t channel_config4 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN4);
    nrf_saadc_channel_config_t channel_config5 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN5);
    nrf_saadc_channel_config_t channel_config6 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN6);
    nrf_saadc_channel_config_t channel_config7 =
        NRFX_SAADC_DEFAULT_CHANNEL_CONFIG_SE(NRF_SAADC_INPUT_AIN7);    
    //初始化SAADC，注册事件回调函数。
	  err_code = nrf_drv_saadc_init(NULL, saadc_callback);
    APP_ERROR_CHECK(err_code);
    //初始化SAADC通道0
    err_code = nrfx_saadc_channel_init(0, &channel_config0); 
    err_code = nrfx_saadc_channel_init(1, &channel_config1);
    err_code = nrfx_saadc_channel_init(2, &channel_config2);
    err_code = nrfx_saadc_channel_init(3, &channel_config3);
    err_code = nrfx_saadc_channel_init(4, &channel_config4);
    err_code = nrfx_saadc_channel_init(5, &channel_config5);    
    err_code = nrfx_saadc_channel_init(6, &channel_config6);
    err_code = nrfx_saadc_channel_init(7, &channel_config7);

    APP_ERROR_CHECK(err_code);

}

/**@brief Application main function.
 */
uint32_t       err_code;
uint8_t data_array1[60];
uint8_t ave_flag=0;
float temp_val0,temp_val1,temp_val2,temp_val3,temp_val4,temp_val5,temp_val6,temp_val7;
float adc0_val,adc1_val,adc2_val,adc3_val,adc4_val,adc5_val,adc6_val,adc7_val;
uint16_t length1 = 43;
uint16_t id_class_stai = 0;
    bool erase_bonds;
    float AHT10wd=0;uint8_t AHT10sd=0;
    float bmpdqy=0,bmpwd=0,bmphb=0;
	nrf_saadc_value_t  saadc_val0,saadc_val1,saadc_val2,saadc_val3,saadc_val4;
    nrf_saadc_value_t  saadc_val5,saadc_val6,saadc_val7;
void fill_buffer_stai(float sample_buffer_stai[])
{
	sample_buffer_stai[0]=saadc_val0;
    sample_buffer_stai[1]=saadc_val1;
	sample_buffer_stai[2]=saadc_val2;
	sample_buffer_stai[3]=saadc_val3;
	sample_buffer_stai[4]=saadc_val4;
}


int main(void)
{

    // Initialize.
    uart_init();//串口初始化
   // log_init();//log打印初始化
    timers_init();//软件定时器初始化
    buttons_leds_init(&erase_bonds);//按键LED灯初始化
    //power_management_init();//能量管理
    ble_stack_init();//协议栈初始化
    gap_params_init();//GAP初始化
    gatt_init();//GATT初始化
    services_init();//服务初始化
    advertising_init();//广播初始化
    conn_params_init();//连接参数更新初始化
    saadc_init();
    // Start execution.
//    printf("\r\nUART started.\r\n");
//    NRF_LOG_INFO("Debug logging for UART over RTT started.");
    advertising_start();//开始广播
    ATH10Init();
    bmp280Init();
    neai_classification_init_stai(knowledge_stai);
    //bmp280Init(); 
    // Enter main loop.
    while(true)  
    {
       idle_state_handle();

	   
        
//      ATH10ReadData(&AHT10wd,&AHT10sd);
//      nrf_delay_us(500);
//      bmp280GetData(&bmpdqy,&bmpwd,&bmphb);
      if(ave_flag<10)
     {   
         nrfx_saadc_sample_convert(0,&saadc_val0);
         nrfx_saadc_sample_convert(1,&saadc_val1);
         nrfx_saadc_sample_convert(2,&saadc_val2);
		 nrfx_saadc_sample_convert(3,&saadc_val3);
		 nrfx_saadc_sample_convert(4,&saadc_val4);    
		 nrfx_saadc_sample_convert(5,&saadc_val5);
		 nrfx_saadc_sample_convert(6,&saadc_val6);
		 nrfx_saadc_sample_convert(7,&saadc_val7);
         ave_flag++;
         temp_val0+=saadc_val0;
         temp_val1+=saadc_val1;
         temp_val2+=saadc_val2;
         temp_val3+=saadc_val3;
         temp_val4+=saadc_val4;
         temp_val5+=saadc_val5;         
         temp_val6+=saadc_val6; 
         temp_val7+=saadc_val7;         
     }
     if(ave_flag==10)
     {
//         
         adc0_val=temp_val0/ave_flag* 3.6f/4096.0f*1000;
         adc1_val=temp_val1/ave_flag* 3.6f/4096.0f*1000;
         adc2_val=temp_val2/ave_flag* 3.6f/4096.0f*1000;
         adc3_val=temp_val3/ave_flag* 3.6f/4096.0f*1000;        
         adc4_val=temp_val4/ave_flag* 3.6f/4096.0f*1000;
         adc5_val=temp_val5/ave_flag* 3.6f/4096.0f*1000;
         adc6_val=temp_val6/ave_flag* 3.6f/4096.0f*1000;
         adc7_val=temp_val7/ave_flag* 3.6f/4096.0f*1000;
//         data_array1[0]=((int)adc0_val/1000)%10+'0';
//         data_array1[1]='.';
//         data_array1[2]=((int)adc0_val/100)%10+'0';  
//         data_array1[3]=((int)adc0_val/10)%10+'0'; 
//         data_array1[4]=(int)adc0_val%10+'0';       
//         data_array1[5]='\t';
//         data_array1[6]=((int)adc1_val/1000)%10+'0';
//         data_array1[7]='.';         
//         data_array1[8]=((int)adc1_val/100)%10+'0'; 
//         data_array1[9]=((int)adc1_val/10)%10+'0';  
//         data_array1[10]=(int)adc1_val%10+'0';   
//         data_array1[11]='\t';                  
//         data_array1[12]=((int)adc2_val/1000)%10+'0';
//         data_array1[13]='.';         
//         data_array1[14]=((int)adc2_val/100)%10+'0'; 
//         data_array1[15]=((int)adc2_val/10)%10+'0';  
//         data_array1[16]=(int)adc2_val%10+'0';            
//         data_array1[17]='\t';         
//         data_array1[18]=((int)adc3_val/1000)%10+'0';
//         data_array1[19]='.';         
//         data_array1[20]=((int)adc3_val/100)%10+'0'; 
//         data_array1[21]=((int)adc3_val/10)%10+'0';  
//         data_array1[22]=(int)adc3_val%10+'0';            
//         data_array1[23]='\t';         
//         data_array1[24]=((int)adc4_val/1000)%10+'0';
//         data_array1[25]='.';         
//         data_array1[26]=((int)adc4_val/100)%10+'0'; 
//         data_array1[27]=((int)adc4_val/10)%10+'0';  
//         data_array1[28]=(int)adc4_val%10+'0';            
//         data_array1[29]='\t';         
//         data_array1[30]=((int)adc5_val/1000)%10+'0'; 
//         data_array1[31]='.';         
//         data_array1[32]=((int)adc5_val/100)%10+'0'; 
//         data_array1[33]=((int)adc5_val/10)%10+'0';  
//         data_array1[34]=(int)adc5_val%10+'0';            
//         data_array1[35]='\t';         
//         data_array1[36]=((int)adc6_val/1000)%10+'0';
//         data_array1[37]='.';         
//         data_array1[38]=((int)adc6_val/100)%10+'0'; 
//         data_array1[39]=((int)adc6_val/10)%10+'0';  
//         data_array1[40]=(int)adc6_val%10+'0';            
//         data_array1[41]='\t';         
//         data_array1[42]=((int)adc7_val/1000)%10+'0';
//         data_array1[43]='.';         
//         data_array1[44]=((int)adc7_val/100)%10+'0'; 
//         data_array1[45]=((int)adc7_val/10)%10+'0';  
//         data_array1[46]=(int)adc7_val%10+'0';                            
//         data_array1[47]='\r';
//         data_array1[48]='\n';         
       fill_buffer_stai(input_user_buffer_stai);
	   neai_classification_stai(input_user_buffer_stai, output_class_buffer_stai, &id_class_stai);  
         
         data_array1[0]='/';
         data_array1[1]='*';
         data_array1[2]=((int)AHT10wd/1000)%10+'0';  
         data_array1[3]=((int)AHT10wd/100)%10+'0'; 
         data_array1[4]=((int)AHT10wd/10)%10+'0';  
         data_array1[5]=(int)AHT10wd%10+'0';          
         data_array1[6]=',';
         data_array1[7]=((int)AHT10sd/1000)%10+'0';  
         data_array1[8]=((int)AHT10sd/100)%10+'0'; 
         data_array1[9]=((int)AHT10sd/10)%10+'0';  
         data_array1[10]=(int)AHT10sd%10+'0';   
         data_array1[11]=',';                  
         data_array1[12]=((int)bmpdqy/1000)%10+'0';  
         data_array1[13]=((int)bmpdqy/100)%10+'0'; 
         data_array1[14]=((int)bmpdqy/10)%10+'0';  
         data_array1[15]=(int)bmpdqy%10+'0';            
         data_array1[16]=',';         
         data_array1[17]=((int)adc3_val/1000)%10+'0';  
         data_array1[18]=((int)adc3_val/100)%10+'0'; 
         data_array1[19]=((int)adc3_val/10)%10+'0';  
         data_array1[20]=(int)adc3_val%10+'0';            
         data_array1[21]=',';         
         data_array1[22]=((int)adc4_val/1000)%10+'0';  
         data_array1[23]=((int)adc4_val/100)%10+'0'; 
         data_array1[24]=((int)adc4_val/10)%10+'0';  
         data_array1[25]=(int)adc4_val%10+'0';            
         data_array1[26]=',';         
         data_array1[27]=((int)adc5_val/1000)%10+'0';  
         data_array1[28]=((int)adc5_val/100)%10+'0'; 
         data_array1[29]=((int)adc5_val/10)%10+'0';  
         data_array1[30]=(int)adc5_val%10+'0';            
         data_array1[31]=',';         
         data_array1[32]=((int)adc6_val/1000)%10+'0';  
         data_array1[33]=((int)adc6_val/100)%10+'0'; 
         data_array1[34]=((int)adc6_val/10)%10+'0';  
         data_array1[35]=(int)adc6_val%10+'0';            
         data_array1[36]=',';         
         data_array1[37]=((int)adc7_val/1000)%10+'0';  
         data_array1[38]=((int)adc7_val/100)%10+'0'; 
         data_array1[39]=((int)adc7_val/10)%10+'0';  
         data_array1[40]=(int)adc7_val%10+'0';                            
         data_array1[41]='*';
         data_array1[42]='/';

//          do
//        {
            
            err_code = ble_nus_data_send(&m_nus, data_array1, &length1, m_conn_handle);//从机数据上传函数
//            if ((err_code != NRF_ERROR_INVALID_STATE) &&
//               (err_code != NRF_ERROR_RESOURCES) &&
//                (err_code != NRF_ERROR_NOT_FOUND))
//            {
//                APP_ERROR_CHECK(err_code);
//            }
//        } while (err_code == NRF_ERROR_RESOURCES);   
//printf("/*%f,%f,%f,%f,%f ,%f,%f,%f*/",adc0_val* 3.6f/4096.0f,adc1_val* 3.6f/4096.0f,
//         adc2_val* 3.6f/4096.0f,adc3_val* 3.6f/4096.0f,
//         adc4_val* 3.6f/4096.0f,adc5_val* 3.6f/4096.0f,adc6_val* 3.6f/4096.0f,adc7_val* 3.6f/4096.0f);
         temp_val0=0;
         temp_val1=0;
         temp_val2=0;
         temp_val3=0;  
         temp_val4=0;
         temp_val5=0;
         temp_val6=0;
         temp_val7=0; 
         ave_flag=0; 
 
               
     }
    }
}


/**
 * @}
 */
